Revit 2026 API

# PlanViewRange Properties

---

The PlanViewRange type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | View range for the current plane |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LevelAbove | View range for the level above the specified plane |
|  | LevelBelow | View range for the level below the specified plane |
|  | Unlimited | View range is unlimited |

#### Reference

PlanViewRange Class

Autodesk.Revit.DB Namespace